In [89]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [90]:
import pandas as pd

In [91]:
dic = {
    'fruits' : ["apple","banana","orange"],
    'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]

}
print(dic)
a=pd.DataFrame(dic)
print(a)

{'fruits': ['apple', 'banana', 'orange'], 'cars': ['BMW', 'Volvo', 'Ford'], 'passings': [3, 7, 2]}
   fruits   cars  passings
0   apple    BMW         3
1  banana  Volvo         7
2  orange   Ford         2

In [92]:
fruits=["apple","banana","mango"]
a=pd.Series(fruits)
print(a)

0     apple
1    banana
2     mango
dtype: object

In [93]:

dic=["fruits","cars","passings"]
a=pd.Series(dic,index=[6,10,2])
print(a)

6       fruits
10        cars
2     passings
dtype: object

In [94]:
sub=["dbms","dcf","java"]
a=pd.Series(sub,index=[2,4,6])
print(a)
b=a.to_csv("sample.csv")
print(b)
c = pd.read_csv("sample.csv")
print(c)

2    dbms
4     dcf
6    java
dtype: object
None
   Unnamed: 0     0
0           2  dbms
1           4   dcf
2           6  java

In [95]:
pd.read_csv('sample.csv')

   Unnamed: 0     0
0           2  dbms
1           4   dcf
2           6  java

In [96]:
dic={
        'cars': ["BMW", "Volvo", "Ford"],
        'years':[1999,2001,2010]
}
print(dic)
a=pd.DataFrame(dic)
print(a)
b=a.to_csv("sample2.csv")

c = pd.read_csv("sample2.csv")
print(c)

a.head()

{'cars': ['BMW', 'Volvo', 'Ford'], 'years': [1999, 2001, 2010]}
    cars  years
0    BMW   1999
1  Volvo   2001
2   Ford   2010
   Unnamed: 0   cars  years
0           0    BMW   1999
1           1  Volvo   2001
2           2   Ford   2010

    cars  years
0    BMW   1999
1  Volvo   2001
2   Ford   2010

In [97]:
dic={
        'cars': ["BMW", "Volvo", "Ford","Volvo","Volvo","Volvo","Volvo"],
        'years':[1999,2001,2010,2022,2024,2025,2054],
        'fruits': ["orange","apple","banana","mango","kiwi","grapes","pineapple"],
        'subject':["dbms","java","ccn","python","android","english",'maths'],
        'colors':["green","blue","pink","orange","green","blue","black"],
        'place':["kannur","kozhikode","vadakara","malappuram","kasaragod","kollam","goa"]
}
a=pd.DataFrame(dic)
print(a)
a.head()
a.tail()
a.info()
a.describe()

    cars  years     fruits  subject  colors       place
0    BMW   1999     orange     dbms   green      kannur
1  Volvo   2001      apple     java    blue   kozhikode
2   Ford   2010     banana      ccn    pink    vadakara
3  Volvo   2022      mango   python  orange  malappuram
4  Volvo   2024       kiwi  android   green   kasaragod
5  Volvo   2025     grapes  english    blue      kollam
6  Volvo   2054  pineapple    maths   black         goa
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   cars     7 non-null      object
 1   years    7 non-null      int64
 2   fruits   7 non-null      object
 3   subject  7 non-null      object
 4   colors   7 non-null      object
 5   place    7 non-null      object
dtypes: int64(1), object(5)
memory usage: 468.0+ bytes

             years
count     7.000000
mean   2019.285714
std      18.705741
min    1999.000000
25%    2005.500000
50%    2022.000000
75%    2024.500000
max    2054.000000

In [98]:
dic={
        'cars': ["BMW", "Volvo", "Ford",None,"Volvo","Volvo","Volvo"],
        'years':[1999,2001,2010,2022,2024,2025,2054],
        'fruits': ["orange",None,"banana","mango","kiwi","grapes","pineapple"],
        'subject':["dbms","java","ccn","python","android","english",'maths'],
        'colors':["green","blue","pink","orange","green",None,"black"],
        'place':["kannur","kozhikode","vadakara","malappuram","kasaragod",None,"goa"]
}
a=pd.DataFrame(dic)
print(a)
a.dropna()
a.fillna("zzzzz")

    cars  years     fruits  subject  colors       place
0    BMW   1999     orange     dbms   green      kannur
1  Volvo   2001       None     java    blue   kozhikode
2   Ford   2010     banana      ccn    pink    vadakara
3   None   2022      mango   python  orange  malappuram
4  Volvo   2024       kiwi  android   green   kasaragod
5  Volvo   2025     grapes  english    None        None
6  Volvo   2054  pineapple    maths   black         goa

    cars  years     fruits  subject  colors       place
0    BMW   1999     orange     dbms   green      kannur
1  Volvo   2001      zzzzz     java    blue   kozhikode
2   Ford   2010     banana      ccn    pink    vadakara
3  zzzzz   2022      mango   python  orange  malappuram
4  Volvo   2024       kiwi  android   green   kasaragod
5  Volvo   2025     grapes  english   zzzzz       zzzzz
6  Volvo   2054  pineapple    maths   black         goa

In [99]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [100]:
dic={
        'cars': ["BMW", "Volvo", "Ford","Volvo","Volvo","Volvo","Volvo"],
        'years':[1999,2001,2010,2022,2024,2025,2054],
        'fruits': ["orange","apple","banana","mango","kiwi","grapes","pineapple"],
        'subject':["dbms","java","ccn","python","android","english",'maths'],
        'colors':["green","blue","pink","orange","green","blue","black"],
        'place':["kannur","kozhikode","vadakara","malappuram","kasaragod","kollam","goa"]
}
a=pd.DataFrame(dic)
print(a)

b=a.to_excel("sample.xlsx")

pd.read_excel("sample.xlsx")

    cars  years     fruits  subject  colors       place
0    BMW   1999     orange     dbms   green      kannur
1  Volvo   2001      apple     java    blue   kozhikode
2   Ford   2010     banana      ccn    pink    vadakara
3  Volvo   2022      mango   python  orange  malappuram
4  Volvo   2024       kiwi  android   green   kasaragod
5  Volvo   2025     grapes  english    blue      kollam
6  Volvo   2054  pineapple    maths   black         goa

   Unnamed: 0   cars  years     fruits  subject  colors       place
0           0    BMW   1999     orange     dbms   green      kannur
1           1  Volvo   2001      apple     java    blue   kozhikode
2           2   Ford   2010     banana      ccn    pink    vadakara
3           3  Volvo   2022      mango   python  orange  malappuram
4           4  Volvo   2024       kiwi  android   green   kasaragod
5           5  Volvo   2025     grapes  english    blue      kollam
6           6  Volvo   2054  pineapple    maths   black         goa